Tekla Open API Reference for Tekla Structures 2025
LevelMark Constructor (ViewBase, Point, Point, PlacingBase)
 Initializes a new instance of the LevelMark class using the given attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LevelMark(
	ViewBase View,
	Point InsertionPoint,
	Point BasePoint,
	PlacingBase Placing
)
Public Sub New (
	View As ViewBase,
	InsertionPoint As Point,
	BasePoint As Point,
	Placing As PlacingBase
)
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
The view where to insert the level mark.
InsertionPoint
Type: Tekla.Structures.Geometry3d.Point
The location where to place the level mark.
BasePoint
Type: Tekla.Structures.Geometry3d.Point
The location where to the level mark points.
Placing
Type: Tekla.Structures.Drawing.PlacingBase
The way the object is placed.
See Also
Reference
LevelMark Class
LevelMark Overload
Tekla.Structures.Drawing Namespace